Repository: 84000/data-translation-memory
Catalog: Toh_207-Strength_of_the_Elephant-v2.tmx
Source language: bo
Languages: en

source: གླང་པོའི་རྩལ་ཞེས་བྱ་བ་
en: The Strength of the Elephant

source: ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Great Vehicle Sūtra

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་ལྔ་བརྒྱ་ཙམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་གྲགས་པས་མངོན་པར་གྲགས་པ། གཟུངས་ཐོབ་པ། སྤོབས་པ་ཐོགས་པ་མེད་པ། གཉིས་སུ་མེད་པའི་ཆོས་འཆད་པ། རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ་དྲུག་ཁྲི་དང་ཡང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: The Blessed One was dwelling on Gṛdhrakūṭa Mountain together with a large saṅgha of monks comprised of five hundred monks as well as sixty thousand bodhisattvas who were all renowned, had attained the dhāraṇīs , possessed unobstructed eloquence, taught the Dharma of nonduality, and displayed inconceivable miraculous powers.

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་དཔེ་མེད་བློ་གྲོས་དང་། མངོན་པར་གནོན་པའི་སྒྲ་སྒྲོགས་གཟི་བརྗིད་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་བཞིའི་མེ་ཏོག་རྒྱས་པ་དང་། གློག་ཆེན་སྒྲོན་མ་དང་། མཐའ་ཡས་པར་ལྟ་ཞིང་ཡུལ་ཐམས་ཅད་ལས་འདས་པ་དང་། རི་རབ་བརྩེགས་པ་ལྟར་མངོན་པར་འཕགས་པ་དང་། མངོན་པར་དགའ་བས་མགུ་བ་སྐྱེད་པ་དང་། དཔུང་པ་དྲི་མ་མེད་པས་འོད་ཟེར་བཅོམ་པ་དང་། སེམས་ཅན་གྱི་བསམ་པ་ངེས་པའི་དོན་གྱི་ཕ་རོལ་དུ་བགྲོད་པར་དོང་བ་དང་། རྡོ་རྗེ་ལྟ་བུར་བརྟན་པ་ཐོབ་པ་དང་། སྒྲར་བརྗོད་པ་དང་། དབྱངས་དང་ང་རོ་ཐམས་ཅད་ལས་འདས་པ་དང་། ཚངས་པའི་སྒྲ་གཟི་བརྗིད་མངོན་པར་འཕགས་པ་དང་། གྲགས་པའི་སྒྲས་འཇིགས་པ་བཅོམ་པ་དང་། དགེ་བའི་རྩ་བ་རིན་པོ་ཆེ་ཐམས་ཅད་བསགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་།
en: They included the bodhisattva great beings Perseverant Beyond Compare and Wise; Essence of the Splendor of Overwhelming Sound, Blossom of the Four Jewels; Light Beam of Great Lightning; Seeing Beyond Extremes and Transcending All Sensory Objects; Lofty Like Mount Meru’s Summit; Gladdened with Supreme Joy; Light Vanquishing with Undefiled Forces; Reaching the Far Shore of Definitive Meaning to Fulfill Beings’ Aspirations; Possessing Vajralike Solidity; Beyond All Utterances, Speech, and Sounds; Voice More Majestic Than Brahmā’s; Overcoming Fears with Words of Renown; Accumulation of All Precious Roots of Virtue; and the bodhisattva great being Youthful Mañjuśrī.

source: དེ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དྲུག་ཁྲི་རྣམས་དང་ཐབས་ཅིག་གོ། །
en: These and other such bodhisattvas in attendance were sixty thousand in number.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཕྱི་དྲོའི་དུས་ན། ནང་དུ་ཡང་དག་འཇོག་ལས་ལངས་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། །ཡང་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཤིང་གཞན་ཞིག་གི་དྲུང་ན་རབ་ཏུ་ཞི་བ་སྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་སྟེ་བཞུགས་སོ། །
en: In the afternoon, the venerable Śāradvatīputra, after arising from inner absorption, approached the Blessed One who at that time was sitting in front of another tree, immersed in the absorption known as accomplishment of perfect peace .

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་རྒྱང་རིང་པོ་ནས་བཅོམ་ལྡན་འདས་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ་མཐོང་བ་དང་
en: From afar, the venerable Śāradvatīputra saw the Blessed One, who was peaceful.

source: མྱུར་དུ་རྩྭ་བསྡུས་ནས་ཕྱོགས་གཅིག་ཏུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ལུས་བསྲང་སྟེ། དྲན་པ་མངོན་དུ་བྱས་ནས་འདུག་གོ། །
en: He quickly gathered some grass and sat down mindfully to one side with his legs crossed and back straightened.

source: དེ་དེར་འདུག་མ་ཐག་ཏུ་
en: As soon as he sat there,

source: ཨེ་མའོ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་པ་རབ་ཏུ་ཞི་བ་འདི་དང་། བདེ་བ་དང་། ཡིད་བདེ་བ་འདི་ངོ་མཚར་ཏོ། །
en: “How marvelous are the Tathāgata’s perfectly peaceful behavior, happiness, and bliss!

source: སེམས་ཅན་གང་དག་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མཉམ་པར་བཞག་པར་རབ་ཏུ་ཤེས་པ་དེ་དག་ནི་བདེ་བ་དང་ལྡན་པ་ཡིན་ནོ་
en: Happy are the beings who realize that all phenomena naturally rest in the state of absorption!”

source: སྙམ་དུ་སེམས་ལ་སེམས་ཀྱི་རྟོག་པ་དེ་ལྟ་བུ་སྐྱེས་སོ། །
en: thoughts arose in his mind, such as:

source: དེ་ནས་བཅོམ་ལྡན་འདས་དགོངས་ཤིང་མཁྱེན་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་ཏེ་མགུར་བསལ་བའི་སྒྲ་ཕྱུང་ངོ་། །
en: The Blessed One, perceiving and understanding this, emerged from his concentration and made the sound of clearing his throat.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ཀྱི་མགུར་བསལ་བའི་སྒྲ་ཐོས་པ་དང་དགའ་མགུ་རངས་པར་གྱུར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: Hearing the Blessed One clear his throat, the venerable Śāradvatīputra became filled with joy and inspiration, and walked toward where the Blessed One was sitting.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ། །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: When he arrived in the Blessed One’s presence, he prostrated to him in amazement and uttered the following verses:

source: སྟོང་པའི་ཆོས་ལ་ཇི་ལྟར་བདག་བཟོད་བཞིན། །གང་དག་སེམས་ཅན་ཡང་དག་མི་རྟོག་ཅིང་། །ཆོས་ལའང་ནམས་ཀྱང་རྟོག་པར་མི་བྱེད་པ། །འཇིག་རྟེན་ན་ནི་དེ་དག་མཉམ་པར་བཞག །
en: “In the way I accept that phenomena are empty, Those who neither conceptualize beings Nor ever conceptualize phenomena Remain in the world in absorption.

source: སེམས་ཅན་འཁྲུལ་ལ་ནམས་ཀྱང་མི་ལྟ་ཞིང་། །ཆོས་རྣམས་ནམ་མཁའ་བཞིན་དུ་བསམས་བྱས་ནས། །གང་དག་སྒྱུ་མའི་ངོ་བོ་ཉིད་མོས་པ། །གང་དག་བདག་ཏུ་ལྟ་མེད་དེ་དག་བདེ། །
en: “Never ever looking at the confusion of beings, And considering phenomena to be just like space, Happy are those who believe in the illusory nature And do not hold the view of a self.

source: འདི་དག་སེམས་ཅན་ཡིན་ནམ་མ་ཡིན་ཞེས། །འདུ་ཤེས་ཐམས་ཅད་ལ་ནི་མི་དམིགས་པ། །སེམས་ཅན་ཀུན་ལ་འདུ་ཤེས་མེད་པ་དང་། །གང་དག་སེམས་ཅན་ལྟ་མེད་དེ་དག་བདེ། །
en: “Happy are those who do not focus on any conception, Such as ‘these are beings’ or ‘these are not beings,’ Who have no conception of any being, And do not hold the view that there are beings.

source: རིལ་པོར་འདུ་ཤེས་ནམས་ཀྱང་གང་མ་ཆགས། །ནམས་ཀྱང་དངོས་པོའི་འདུ་ཤེས་རྨོངས་པ་མེད། །ལྡང་བར་མི་བྱེད་འདུག་པར་བྱེད་པའང་མེད། །གང་དག་སྲོག་ཏུ་ལྟ་མེད་དེ་དག་བདེ། །
en: “Happy are those who are not attached to any conception of a substantial whole, Who are without the deluded conception of a substantial thing, Who neither cause things to arise nor to remain, And who are without the view of a soul.

source: སེམས་ཅན་ཐ་དད་མི་བྱེད་མཁས་པ་གང་། །ཆོས་ཀྱི་དབྱིངས་དང་འགལ་བར་མི་འགྱུར་ལ། །གང་ཟག་འདུ་ཤེས་ཐམས་ཅད་རྣམ་པར་བཤིག །གང་དག་ཐ་དད་བློ་མེད་དེ་དག་བདེ། །
en: “Happy are the wise ones who do not differentiate among beings, Who do not contradict the domain of truth, Who eliminate all conceptions of personhood, And who do not think in terms of dichotomies.

source: གང་དག་སྦྱིན་དང་ཚུལ་ཁྲིམས་རྟག་ཏུ་གནས། །འཇུངས་པའི་བསམ་པར་ནམས་ཀྱང་མ་གྱུར་ཅིང་། །གོང་བུའི་ཆོས་ལའང་ཡང་དག་མི་གནས་པ། །གང་དག་ཚུལ་ཁྲིམས་རློམ་མེད་དེ་དག་བདེ། །
en: “Happy are those who always maintain generosity and discipline, Neither forming the concept of miserliness Nor fixating on the notion of accumulation, And who remain free of moral conceit.

source: གང་དག་བཟོད་དང་ངེས་པའི་ཡོན་ཏན་འཕགས། །གང་དག་ཐབ་མོ་དག་ལའང་མི་ལྟ་ཞིང་། །བརྩོན་འགྲུས་ལྡན་མིན་ལེ་ལོ་ཅན་ཡང་མིན། །གང་དག་བཟོད་པའི་འདུ་ཤེས་མེད་པ་དེ་དག་བདེ། །
en: “Happy are those who excel in the qualities of endurance and determination, Who are free from the notion of conflict, Who are neither zealous nor lazy, And who have no preconception concerning patience.

source: གང་དག་བསམ་གཏན་བྱེད་ཅིང་བརྟན་པ་མི་གནས་པ། །དེ་ཡང་གཡེང་བར་རྣམ་པར་མི་སེམས་པ། །མཉམ་པར་བཞག་པའི་ཆོས་རྣམས་རབ་ཏུ་ཤེས། །གང་དག་བསམ་གཏན་འདུ་ཤེས་མེད་པ་དེ་དག་བདེ། །
en: “Happy are those who are not fixated on concentration and stability, And yet do not think about distractions— Who understand the qualities of meditative equipoise And have no preconceptions about concentration.

source: གང་དག་འདུ་ཤེས་མེད་ཅིང་འདི་ལ་ཤེས་རབ་མེད། །མི་ཤེས་དབང་དུ་འགྲོ་བའང་མ་ཡིན་ལ། །མཁས་པའང་མ་ཡིན་རྨོངས་པའང་ཡོད་མ་ཡིན། །གང་དག་ཤེས་རབ་འདུ་ཤེས་མེད་དག་བདེ། །
en: “Happy are those who are free from preconceptions about anything, Who have no insight regarding anything and yet are not under the sway of ignorance, Who are neither learned nor deluded, And who have no preconceptions about wisdom.

source: ཇི་ལྟར་དགོན་པ་དེ་བཞིན་གྲོང་ན་གནས། །གཉི་གར་འདུ་ཤེས་མཚུངས་ཤིང་མཉམ་པར་འཇུག །གྲོང་གི་སྤྱོད་ཡུལ་སྨོད་པར་མི་བྱེད་ཅིང་། །གང་དག་དགོན་པས་མི་རློམ་དེ་དག་བདེ། །
en: “Happy are those who dwell in a city as if in retreat, Who treat them equally, with similar conceptions of both— Who do not disparage city life But also do not idealize retreat.

source: གང་དག་བསོད་སྙོམས་ཁྱིམ་དང་བཅས་པར་སྤྱོད། །དེ་དག་བསོད་སྙོམས་དེ་ཡི་འདུ་ཤེས་མེད། །བསོད་སྙོམས་སྤྱོད་པ་བདག་ཡིན་སྙམ་མི་སེམས། །གང་དག་བསོད་སྙོམས་འདུ་ཤེས་མེད་དག་བདེ། །
en: “Happy are those practice alms-begging as a householder Without any preconception about this alms-begging. Without entertaining thoughts such as ‘I am a mendicant,’ They have no preconceptions about alms-begging.

source: གང་དག་བོར་བའི་ཕྱག་དར་ཁྲོད་པ་རྣམས། །བླངས་ནས་བདག་གིས་ལུས་ལ་འཆང་བར་བྱེད། །བདག་ནི་གོས་ངན་སྙམ་དུ་དེ་མི་སེམས། །གང་དག་གཞན་ལ་མི་སྨོད་དེ་དག་བདེ། །
en: “Happy are those who pick up refuse-rags And wear them on their body. They do not think ‘I have miserable clothing,’ And they do not put down others.

source: སངས་རྒྱས་གནང་ཞིང་བདེ་གཤེགས་བསྔགས་པ་ཡི། །ཆོས་གོས་གསུམ་ལས་ལྷག་པར་མི་འཆང་ཞིང་། །བདག་ནི་འཇིགས་མེད་ཡིན་པར་མི་རྟོག་པ། །གང་དག་ང་རྒྱལ་མེད་པ་དེ་དག་བདེ། །
en: “Happy are those who wear nothing but the three Dharma robes Approved by the Buddha and praised by the sugatas, Yet do not think ‘I am fearless,’ And remain without pride.

source: གང་ན་བདག་མེད་སེམས་ཅན་ཡོད་མིན་པའི། །གང་དག་ཆོས་མཆོག་དམ་པ་འཆད་བྱེད་པ། །བདག་ནི་འཆད་མཁན་ཡིན་པར་སེམས་པའང་མེད། །གང་དག་མེད་པར་མ་གྱུར་དེ་དག་བདེ། །
en: “Happy are those who teach the supreme and sacred Dharma In which there is neither self nor being. They do not even think ‘I am a master teacher,’ But they also do not amount to nothing.

source: དཀར་པོ་ཀུན་ལ་ཡང་དག་འདུ་ཤེས་མེད། །སྙིང་པོ་མེད་པ་རྗེས་སུ་འདུ་ཤེས་མེད། །དཀར་དང་གནག་པར་གང་དག་མི་སེམས་པ། །གང་དག་གཉིས་སུ་མི་སྤྱོད་དེ་དག་བདེ། །
en: “Happy are those who are free from preconceptions regarding any virtue, Who do not conceive of anything as an essence or a substance, Who do not think of anything as virtuous or nonvirtuous, But who do not behave in a dualistic way.

source: གང་དག་ལངས་ལ་ལངས་པར་འདུ་ཤེས་མེད། །འདུག་ཀྱང་འདུག་པར་འདུ་ཤེས་ཡོད་མ་ཡིན། །ཉིན་མཚན་ཕྱད་པར་འཆག་ཅིང་བརྩོན་འགྲུས་རྩོམ། །གང་དག་སྤྲོས་པ་མེད་པ་དེ་དག་བདེ། །
en: “Happy are those who stand but have no preconception about standing, Who sit but have no preconception about sitting, Who at all times cultivate diligence as they move about And remain without mental elaboration.

source: གང་དག་གནས་མིན་གནས་པར་མི་རྟོག་ཅིང་། །ཁྱད་པར་ཤེས་པ་ཞི་བར་མི་རྟོག་ལ། །དེ་བཞིན་གཤེགས་དང་མུ་སྟེགས་ཁྱད་པར་མེད། །གང་དག་མཆོག་ཏུ་རློམ་སེམས་མེད་པ་དེ་དག་བདེ། །
en: “Happy are those who are free from preconceptions about abiding or non-abiding, Who do not conceive of some special knowledge as the state of peace, Who make no distinction between tathāgatas and non-Buddhists, And who are without assumptions about what is “the best.”

source: གང་ལ་གྲངས་དང་བགྲང་བའང་ཡོད་མ་ཡིན། །ནམ་མཁའི་དབྱིངས་ལྟར་མཉམ་ཉིད་མི་གཏོང་ལ། །བདག་དང་སེམས་ཅན་ཐ་དད་མི་སེམས་པ། །གང་དག་ཁྱད་པར་ཐོབ་མེད་དེ་དག་བདེ། །
en: “Happy are those for whom there is neither number nor enumeration, Who do not disregard equality that is like the expanse of space, Who do not think of themselves and others as distinct, And who have no special achievements.

source: གང་དག་སྒྱུ་མར་གྱུར་ཅིང་རྨི་ལམ་སྤྱོད། །རབ་ཏུ་མ་རྨོངས་མིག་ཡོར་ལྟ་བུར་གྱུར། །འཇིག་རྟེན་དག་ན་ཆུ་ཟླ་བཞིན་དུ་སྤྱོད། །གང་དག་ཀུན་ཏུ་མི་བརྩོན་དེ་དག་བདེ། །
en: “Happy are those who appear as an illusion and behave as if in a dream, Who resemble optical illusions but are not deluded, Who are active in the worlds like reflections of the moon in water, And who do not strive in any way.

source: སེམས་ཅན་གང་དག་མཁས་ལ་དོན་དམ་ལྟ། །བརྡ་དང་ཐ་སྙད་སྙིང་པོ་མེད་པར་ཤེས། །རབ་ཏུ་ཞི་བའི་ཆོས་རྣམས་རྗེས་སུ་རྟོགས། །གང་དག་མཚན་མའི་སྤྱོད་ཡུལ་མ་ཡིན་དེ་དག་བདེའོ། །
en: “Happy are the beings who are wise and behold the ultimate, Who understand that names and conventions have no essence, Who realize that phenomena are in the state of peace, And who remain unbound by the range of conceptual signs.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Thereupon the Blessed One congratulated the venerable Śāradvatīputra:

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཤེས་རབ་ཟབ་པ་ལ་སྤྱོད་པའི་ཆོས་ལ་མཆོག་ཏུ་གྱུར་པ།
en: “Śāradvatīputra, supreme is this teaching that engages in this way in the profound wisdom!

source: དེ་ལེགས་སོ་ལེགས་སོ། །
en: It is excellent, excellent!

source: ཤཱ་རིའི་བུ་དེ་བས་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་འདི་ལ་དགེ་སློང་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་པ་དེ་དག་ཐམས་ཅད་ཁྱོད་ཀྱིས་སྡུས་ཤིག །
en: Therefore, Śāradvatīputra, assemble all the monks and bodhisattvas abiding in inner absorption on this Gṛdhrakūṭa Mountain, as many as there may be.”

source: ཤཱ་རིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་མི་སྤྲོའོ། །
en: “Blessed One,” replied Śāradvatīputra, “I would prefer not to do so.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why?

source: གླང་པོ་ཆེན་པོ་དག་ནི་མགུ་བར་དཀའ་བའི་སླད་དུའོ། །
en: Because elephants are difficult to please.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཉིད་ཀྱི་སྐུ་ལས་འོད་ཟེར་ཕྱུང་ནས་དེས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་ན་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བསྐུལ་བ་དང་།
en: At that very moment, the Blessed One emitted light rays from his body and he summoned the bodhisattvas abiding in infinite world systems.

source: བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་གང་ན་བ་དང་། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ནས་བར་སྣང་གི་ནམ་མཁའ་ལ་གནས་པར་གྱུར་ཏོ། །
en: They reached the place where the Blessed One was residing on Gṛdhrakūṭa Mountain and hovered in the sky.

source: དགེ་སློང་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་པར་གྱུར་ཏོ། །རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་ཀྱང་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་པར་གྱུར་ཏོ། །
en: All the monks and bodhisattva great beings who had been abiding in inner absorption also arrived where the Blessed One was residing, as did hundreds of thousands of beings from the great city of Rājagṛha.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་ཡོད་པའི་འཁོར་འདུས་པར་མཁྱེན་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་བཞིན་ལ་གཟིགས་སོ། །གཟིགས་ནས་ཀྱང་འཛུམ་པ་མཛད་དོ། །
en: Then the Blessed One, knowing that all were present in the assembly, looked at the face of Youthful Mañjuśrī and smiled.

source: དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: At that moment, Youthful Mañjuśrī rose from his seat, draped his robe over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He bowed in the direction of the Blessed One with joined palms and asked him,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྒྱུ་དང་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན། བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: “As the tathāgatas, the worthy ones, the complete and perfect buddhas do not smile without causes and conditions, what are the causes for your smile, what are the conditions for it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to Youthful Mañjuśrī,

source: འཇམ་དཔལ་སངས་རྒྱས་ཁྲི་རྣམས་ཀྱིས། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་འདི་ལ་གླང་པོའི་རྩལ་ལྟ་བུ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་དོ། །
en: “Mañjuśrī, ten thousand buddhas have expounded the Dharma discourse known as ‘Like the Strength of the Elephant’ on this Gṛdhrakūṭa Mountain.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ཐོས་པ་དང་། མྱུར་བ་མྱུར་བར་རིངས་པའི་ཚུལ་དུ་སྟན་ལས་ལངས་ཏེ། ཆོས་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: When the venerable Ānanda heard what the Blessed One had said, he swiftly rose from his seat, draped his robe over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ད་ཡང་གླང་པོའི་རྩལ་ལྟ་བུ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་བདག་ལ་བཤད་ན་ལེགས་སོ། །
en: “Blessed One, it would be excellent if you could now teach me this Dharma discourse known as ‘Like the Strength of the Elephant.’

source: བདེ་བར་གཤེགས་པ་བདག་ལ་བསྟན་ན་ལེགས་སོ། །
en: Sugata, it would be excellent if you could explain this to me.

source: གང་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་བཞིན་ལ་གཟིགས་ནས་འཛུམ་པ་མཛད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་དེང་སང་ཐོས་པར་དཀོན་ལ།
en: It is rare nowadays to hear a Dharma discourse that would cause you, Blessed One, to smile upon seeing the face of Youthful Mañjuśrī.

source: ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ངོ་མཚར་དུ་འགྱུར་ཞིང་ཟབ་ལ་ཟབ་པར་སྣང་བ་ལགས་སོ། །
en: Such a Dharma discourse must be wonderful. It must be as profound as it seems to be.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་
en: “Ānanda,” replied the Blessed One,

source: འདི་ལྟར་ཁྱོད་ལྷག་མཐོང་ལ་མཁས་ཤིང་དཔྱོད་པ་ལེགས་སོ་ལེགས་སོ། །
en: “you are indeed skilled in the practice of discernment and your analysis is excellent, excellent.

source: དེ་བས་ན་ཀུན་དགའ་བོ་ཁྱོད་ལེགས་པར་ཤིན་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: Therefore, Ānanda, listen very well and keep this in mind. I will explain it to you.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་
en: “Excellent, Blessed One,”

source: ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་ཏོ། །
en: the venerable Ānanda agreed, and he listened as requested.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འདྲིར་གཞུག་པའི་ཕྱིར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་དེ་ལྟ་བུའི་མཚན་མ་མཛད་ནས།
en: The Blessed One made a sign to Youthful Mañjuśrī in order to have him make inquiries about this Dharma discourse.

source: དེའི་ཕྱིར་གང་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་དེ་ལྟ་བུའི་ཟབ་མོ་ཟབ་པ་གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། མཚན་མར་ལྷུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ས་མ་ཡིན་པ་ཞུ་བ་ཞུའོ་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ། །
en: Consequently, Mañjuśrī thought to himself, “I will ask the Tathāgata what is this profound discourse that is not within the realm of hearers, solitary realizers, or bodhisattvas who have fallen into conceptual signs.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེ་ལྟར་ཡིད་ལ་བྱས་ནས་
en: After Youthful Mañjuśrī had reflected upon this, he proposed,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན་བདག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: “If the Blessed One is giving me this opportunity to make inquiries so that the questions can be answered, then I will pose questions on various topics to the Blessed One, the tathāgata, the worthy one, the complete and perfect Buddha.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: the Blessed One replied.

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདི་དག་ཀྱང་འདུས་ཀྱིས་འཇམ་དཔལ་ཁྱོད་གང་དང་གང་འདོད་པ་ཞུས་ཤིག །
en: “Since everyone in this assembly has come together, Mañjuśrī, ask whatever you wish,”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ།
en: Mañjuśrī then asked the following:

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་ཐམས་ཅད་ལ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ལ་ཡང་གདའ་བ་ལགས།
en: “Blessed One, how do bodhisattvas accomplish all their activities while also maintaining all virtuous qualities?

source: སེམས་ཅན་ཚད་མ་མཆིས་གྲངས་མ་མཆིས་པ་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བགྱིད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་ཡང་ཆུའི་ཟླ་བ་ལྟ་བུར་གདའ་བ་ལགས།
en: How do they both remain in all buddhafields like the moon’s reflections in water, and also fully ripen countless beings?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་ཁྱོད་ཀྱིས་མདོར་དོན་ཆེན་པོ་ཞུ་བ་ཞུས་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Mañjuśrī,” replied the Blessed One, “your concise and meaningful questions are excellent, excellent!

source: དེའི་རྣམ་པར་དབྱེ་བ་རྒྱ་ཆེར་ལེགས་པར་ཤིན་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: Listen attentively to this detailed explanation I will give you and keep it in mind.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་འཚལ་ལོ་ཞེས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: “Blessed One, I will do so,” answered Youthful Mañjuśrī, and he listened as requested.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then gave the following reply:

source: འཇམ་དཔལ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དྲུག་དང་ལྡན་ན་བྱ་བ་དེ་དག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་གནས་པར་འགྱུར་རོ། །
en: “Mañjuśrī, if bodhisattvas possess six qualities, they will completely accomplish their tasks and also maintain all virtuous qualities.

source: དྲུག་གང་ཞེ་ན།
en: What are these six?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་བྱེད་པ་ན། སྦྱིན་པའི་བདག་པོ་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ཡིན་མོད་ཀྱི། བདག་སེར་སྣ་སྤྱོད་པ་ལས་རྣམ་པར་ལོག་པར་མི་མཐོང་ངོ་། །
en: If bodhisattvas practice generosity, then although they are benefactors who let go of all their possessions, they do not regard themselves as having completely reversed miserly behavior.

source: ཚུལ་ཁྲིམས་ལ་གནས་པ་ཡིན་མོད་ཀྱི། བདག་ཚུལ་ཁྲིམས་ངན་པའི་ལས་ལས་འདས་པ་ཡིན་པར་མི་ཤེས་སོ། །
en: Although they observe discipline, they not consider themselves as being beyond actions that result from inferior discipline.

source: བཟོད་པ་དང་ངེས་པར་ལྡན་པ་ཡིན་མོད་ཀྱི། བདག་གནོད་སེམས་ཀྱི་སྤྱོད་པ་དང་བྲལ་བར་མི་མཐོང་ངོ་། །
en: Although they possess patience and determination, they do not regard themselves as being free from behavior based on malicious thoughts.

source: བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་མོད་ཀྱི། ལུས་དང་སེམས་ཀྱིས་བརྩོན་པ་མ་ཡིན་ནོ། །
en: Although they cultivate diligence, they do not exert themselves bodily or mentally.

source: བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་མཁས་པ་ཡིན་མོད་ཀྱི། སེམས་རྩེ་གཅིག་ཏུ་གནས་པར་གྱུར་པ་ཡང་མ་ཡིན་ནོ། །
en: Although they are skilled in all concentrations, liberations, absorptions, and all meditative states, they are not stuck in a one-pointed mental state.

source: སྤྱོད་ཡུལ་ཤེས་རབ་ལ་གནས་པ་ཡིན་མོད་ཀྱི། བདག་འགྲོ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་མ་གྲོལ་བར་མཐོང་ངོ་། །
en: Although they exist within the domain of insight, they regard themselves as not being fully liberated from transmigration.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་དྲུག་དང་ལྡན་ན་བྱ་བ་དེ་དག་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་གནས་པ་ཡིན་ནོ། །
en: Mañjuśrī, if bodhisattvas possess these six qualities, they completely accomplish their tasks and also maintain all virtuous qualities.

source: འཇམ་དཔལ་གཞན་ཡང་ཆོས་དྲུག་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་བྱ་བ་དེ་དག་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་གནས་པ་ཡིན་ནོ། །
en: “Mañjuśrī, if bodhisattvas possess another six qualities, they can accomplish their tasks, and also maintain all virtuous qualities.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་དམྱལ་བའི་གནས་ཡོངས་སུ་གཟུང་བ་ཡང་ཡོངས་སུ་འཛིན་ལ་མཐོ་རིས་ཀྱི་ཆོས་ཀྱང་མྱོང་བར་བྱེད་པ་དང་།
en: Bodhisattvas assume the state of a hell being while at the same time experiencing the qualities of the higher realms.

source: དུད་འགྲོར་འགྲོ་བའི་གནས་ཀྱང་ཡོངས་སུ་འཛིན་ལ་མིའི་ཆོས་རྒྱ་ཆེན་པོ་ཡང་མྱོང་བར་བྱེད་པ་དང་།
en: They assume the state of an animal, while at the same time experiencing the great extent of human qualities.

source: རིགས་དམའ་བར་སྐྱེ་བ་ཡོངས་སུ་གཟུང་བ་ཡང་ཡོངས་སུ་འཛིན་ལ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཀྱི་བདེ་བ་ཡང་མྱོང་བར་བྱེད་པ་དང་།
en: They assume a birth in the lower castes, while at the same time experiencing the pleasures of a cakravartin’s kingdom.

source: སྐྱེ་བ་ཐམས་ཅད་དུ་གཏོགས་པར་ཡང་སྟོན་ལ་འགྲོ་བའི་ཁྱད་པར་གྱི་བྱ་བ་རྣམས་ཀྱང་མྱོང་བར་བྱེད་པ་དང་།
en: They manifest within all modes of existence, while at the same time experiencing the activities associated with a specific realm.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་འགྲོ་བ་ལ་མཁས་པ་ཡང་ཡིན་ལ་གནས་ནས་ཀྱང་མི་འཕོ།
en: They are skilled in going to all buddhafields, while at the same time not moving from their location.

source: འགྲོ་བ་ཡང་མེད། འོང་བ་ཡང་མེད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ཡང་ཆུའི་ཟླ་བ་བཞིན་དུ་སྣང་བ་དང་།
en: They neither come nor go, and yet appear in all buddhafields like the moon’s reflections in water.

source: སྒྲ་སྐད་ཐམས་ཅད་ཀྱང་འབྱིན་ལ་ཕན་ཚུན་འདྲེས་པར་ཡང་མི་བྱེད་པ་ཡིན་ཏེ
en: They speak all languages yet do not mix them up.
